nc: 15 # number of classes

backbone:
  # ========== RGB Path (layer 0-10) ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB start
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, RMRFB, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8 (RGB_P3)
  - [-1, 2, RMRFB, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, RMRFB, [512, True]]            # 6 (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, RMRFB, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (RGB_P5)

  # ========== Edge Path (layer 11-21) ==========
  - [-1, 1, Conv, [64, 3, 2], 'Edge']        # 11-P1/2 Edge start
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, RMRFB, [256, False, 0.25]]     # 13
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8 (Edge_P3)
  - [-1, 2, RMRFB, [512, False, 0.25]]     # 15 
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, RMRFB, [512, True]]            # 17 (Edge_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, RMRFB, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, C2PSA, [1024]]                # 21 (Edge_P5)

  # ========== P4 / P5 Fusion ========== 

  - [[6, 17], 1, Concat, [1]]            # 22: P4 fusion (RGB_P4+Edge_P4 → 1024)
  - [-1, 1, AHFFE, [[0.4, 0.4], [8, 8], True, True, True]]

  - [[10, 21], 1, Concat, [1]]           # 24: P5 fusion (RGB_P5+Edge_P5 → 2048)
  - [-1, 1, Conv, [1024, 1, 1]]          # 25: 
  - [-1, 1, AHFFE, [[0.4, 0.4], [8, 8], True, True, True]]

head:

  - [26, 1, nn.Upsample, [None, 2, "nearest"]]  # 27: Fused_P5_HFP upsample
  - [[-1, 23], 1, Concat, [1]]                  # 28: + Fused_P4_HFP
  - [-1, 2, RMRFB, [512, False]]         # 29 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30
  - [[-1, 4], 1, Concat, [1]]                   # 31: + RGB_P3(4)
  - [-1, 2, RMRFB, [256, False]]         # 32 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 33
  - [[-1, 29], 1, Concat, [1]]                  # 34: + layer 29
  - [-1, 2, RMRFB, [512, False]]         # 35 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 36
  - [[-1, 26], 1, Concat, [1]]                  # 37: + Fused_P5_HFP (layer 26)
  - [-1, 2, RMRFB, [1024, True]]         # 38 (P5/32-large)

  - [[32, 35, 38], 1, Segment, [nc, 32, 256]]             # 39